<?php

namespace Faker\Provider;

namespace Faker\Provider\ar_JO;

class Lorem extends \Faker\Provider\Lorem
{
    protected static $wordList = [
        "ذكر", "سلفنا", "الصالح", "رضي", "الله", "عنهم", "أن", "جزيرة", "من", "جزائر",
        "الهند", "التي", "تحت", "خط", "الاستواء", "وهي", "الجزيرة", "يتولد", "بها", "الإنسان",
        "غير", "أم", "ولا", "أب", "وبها", "شجر", "يثمر", "نساء", "المسعودي", "أنها", "الوقواق",
        "لان", "تلك", "اعدل", "بقاع", "الأرض", "هواء", "أتممها", "لشروق", "النور", "الأعلى", "عليها",
        "استعداد", "وان", "كان", "ذلك", "خلاف", "ما", "يراه", "جمهور", "الفلاسفة", "وكبار", "الأطباء",
        "فانهم", "يرون", "إن", "في", "المعمورة", "الإقليم", "الرابع", "فان", "كانوا", "قالوا", "لأنه",
        "صح", "عندهم", "انه", "ليس", "على", "عمارة", "لمانع", "الموانع", "الأرضية", "فلقولهم", "وجه",
        "إنما", "أرادوا", "بذلك", "شديد", "الحرارة", "كالذي", "يصرح", "به", "أكثرهم", "فهو", "خطأ",
        "يقوم", "البرهان", "خلافهوذلك", "أنه", "قد", "تبرهن", "العلوم", "الطبيعية", "لا", "سبب", "لتكون",
        "إلا", "الحركة", "أو", "ملاقاة", "الأجسام", "الحارة", "والإضاءة", "وتبين", "فيها", "أيضا", "الشمس",
        "بذاتها", "حارة", "متكيفة", "بشيء", "هذه", "الكيفيات", "المزاجية", "وقد", "تبين", "تقبل", "الإضاءة",
        "أتم", "القبول", "هي", "الصقيلة", "الشفافة", "ويليها", "قبول", "الكثيفة", "فأما", "لاشيء", "الكثافة",
        "فلا", "الضوء", "بوجهوهذا", "وحده", "مما", "برهنه", "الشيخ", "أبو", "علي", "خاصة", "ولم", "يذكره", "تقدمه",
        "فإذا", "صحت", "المقدمات", "فاللازم", "عنها", "تسخن", "كما", "أجسام", "أخر", "تماسها", "ذاتها", "بالحركة",
        "لأنها", "ساكنة", "وعلى", "حالة", "واحدة", "شروق", "وفي", "وقت", "مغيبها", "وأحوالها", "التسخين",
        "والتبريد", "ظاهرة", "الاختلاف", "للحس", "هذين", "الوقتينولا", "الهواء", "أولا", "ثم", "بعد", "بتوسط",
        "سخونة", "وكيف", "يكون", "ونحن", "نجد", "قرب", "الحر", "أسخن", "كثيرا", "الذي", "يبعد", "منه", "علوا",
        "فبقي", "تسخين", "للأرض", "هو", "سبيل", "تتبع", "أبدا", "حتى", "إذا", "افرط", "المرأة", "المقعرة", "أشعل",
        "حاذاهاوقد", "ثبت", "علوم", "التعاليم", "بالبراهين", "القطعية", "كروية", "الشكل", "وأن", "كذلك", "أعظم",
        "يستضيء", "نصفها", "هذا", "النصف", "المضيء", "كل", "أشد", "وسطه", "أبعد", "المواضع", "المظلمة", "ولأنه",
        "يقابل", "أجزاءا", "أكثر", "وما", "المحيط", "أقل", "ضوءا", "ينتهي", "إلى", "الظلمة", "عند", "محيط",
        "الدائرة", "أضاء", "موقعه", "قط", "وإنما", "الموضع", "وسط", "دائرة", "الضياء", "كانت", "سمت", "رؤوس",
        "الساكنين", "فيه", "وحينئذ", "تكون", "تبعد", "عن", "مسامتة", "أهله", "البرودة", "جدا", "تدوم",
        "المسامتة", "علم", "الهيئة", "تسامت", "أهلها", "سوى", "مرتين", "العام", "حلولها", "برأس", "الحمل",
        "وعند", "الميزانوهي", "سائر", "ستة", "أشهر", "جنوبا", "منهم", "وستة", "شمالا", "فليس", "حر", "مفرط",
        "برد", "وأحوالهم", "بسبب", "متشابهةوهذا", "القول", "يحتاج", "بيان", "يليق", "بما", "نحن", "بسبيله",
        "نبهناك", "عليه", "الأمور", "تشهد", "بصحة", "تجويز", "تولد", "بتلك", "البقعة", "أبفمنهم", "بت", "الحكم",
        "وجزم", "القضية", "بأن", "حي", "بن", "يقظان", "جملة", "ومنهم", "أنكر", "وروى", "أمره", "خبرا", "نقصه",
        "عليك", "فقال", "بازاء", "عظيمة", "متسعة", "الأكتاف", "كثيرة", "الفوائد", "عامرة", "بالناس", "يملكها",
        "رجل", "الأنفة", "والغيرة", "وكانت", "له", "أخت", "ذات", "جمال", "وحسن", "باهر", "فعضلها", "ومنعها",
        "الأزواج", "لم", "يجد", "لها", "كفوا", "وكان", "قريب", "يسمى", "فتزوجها", "سرا", "جائز", "مذهبهم",
        "المشهور", "زمنهمثم", "إنها", "حملت", "ووضعت", "طفلا", "فلما", "خافت", "يفتضح", "أمرها", "وينكشف",
        "سرها", "وضعته", "تابوت", "أحكمت", "زمه", "أروته", "الرضاع", "وخرجت", "أول", "الليل", "خدمها",
        "وثقاتها", "ساحل", "البحر", "وقلبها", "يحترق", "صبابة", "وخوفا", "ودعته", "وقالت", "اللهم", "انك",
        "خلقت", "الطفل", "يكن", "شيئا", "مذكورا", "ورزقته", "ظلمات", "الأحشاء", "وتكفلت", "تم", "واستوى", "وأنا",
        "سلمته", "لطفك", "ورجوت", "فضلك", "خوفا", "الملك", "الغشوم", "الجبار", "العنيد",
    ];
}
